            - الاسم: إعداد بيئة Node.js
  يستخدم: actions/setup-node@v6.2.0
  مع:
    # مواصفات الإصدار المراد استخدامه. أمثلة: 12.x، 10.15.1، >=10.15.0.
    إصدار Node: # اختياري
    # ملف يحتوي على مواصفات الإصدار المراد استخدامه. أمثلة: package.json، .nvmrc، .node-version، .tool-versions.
    ملف إصدار العقدة: # اختياري
    # بنية النظام المستهدفة التي سيستخدمها Node. أمثلة: x86، x64. سيتم استخدام بنية النظام افتراضيًا.
    الهندسة المعمارية: # اختياري
    # قم بتعيين هذا الخيار إذا كنت تريد أن يتحقق الإجراء من أحدث إصدار متاح يفي بمواصفات الإصدار.
    التحقق من آخر التحديثات: # اختياري
    # سجل اختياري لإعداد المصادقة. سيتم تعيين السجل في ملف .npmrc و .yarnrc على مستوى المشروع، وإعداد المصادقة للقراءة من env.NODE_AUTH_TOKEN.
    registry-url: اختياري
    # نطاق اختياري للمصادقة على السجلات ذات النطاق المحدد. سيتم الرجوع إلى مالك المستودع عند استخدام سجل حزم GitHub (https://npm.pkg.github.com/).
    النطاق: # اختياري
    # يُستخدم لسحب توزيعات Node من node-versions. نظرًا لوجود قيمة افتراضية، لا يُحدد المستخدم هذه القيمة عادةً. عند تنفيذ هذا الإجراء على github.com، تكون القيمة الافتراضية كافية. عند التنفيذ على GHES، يمكنك تمرير رمز وصول شخصي لـ github.com إذا كنت تواجه قيودًا على معدل الاستخدام.
    الرمز المميز: # اختياري، القيمة الافتراضية هي ${{ github.server_url == 'https://github.com' && github.token || '' }}
    # يُستخدم لتحديد مدير الحزم للتخزين المؤقت في الدليل الافتراضي. القيم المدعومة: npm، yarn، pnpm.
    ذاكرة التخزين المؤقت: # اختياري
    # اضبط القيمة على false لتعطيل التخزين المؤقت التلقائي. بشكل افتراضي، يتم تمكين التخزين المؤقت عندما يحدد devEngines.packageManager أو حقل packageManager الرئيسي في ملف package.json استخدام npm كمدير للحزم.
    ذاكرة التخزين المؤقت لمدير الحزم: # اختياري، القيمة الافتراضية هي صحيح
    # يُستخدم لتحديد مسار ملف التبعية: package-lock.json، yarn.lock، إلخ. يدعم الأحرف البديلة أو قائمة بأسماء الملفات لتخزين تبعيات متعددة مؤقتًا.
    مسار تبعية التخزين المؤقت: # اختياري
    # يُستخدم لتحديد مرآة بديلة لتنزيل ملفات Node.js الثنائية منها
    المرآة: # اختياري
    # الرمز المميز المستخدم كعنوان Authorization عند جلب البيانات من المرآة
    رمز المرآة: # اختياري
          
